{
  "title": {
    "en": "Projects",
    "ua": "Проекти",
    "ru": "Проекты"
  },
  "imageBaseUrl": "https://raw.githubusercontent.com/moroz-art-dev/",
  "list": [
    {
      "id": "tickets-filter",
      "title": {
        "en": "Tickets Filter",
        "ua": "Фільтр квитків",
        "ru": "Фильтр билетов"
      },
      "description": {
        "en": "This is a React project designed for filtering and sorting flight tickets. The application provides a user-friendly interface to view, filter, and sort flight tickets based on various criteria.",
        "ua": "Це проект на React, створений для фільтрації та сортування авіаквитків. Додаток надає зручний інтерфейс для перегляду, фільтрації та сортування квитків за різними критеріями.",
        "ru": "Это проект на React, разработанный для фильтрации и сортировки авиабилетов. Приложение предоставляет удобный интерфейс для просмотра, фильтрации и сортировки билетов по различным критериям."
      },
      "technologies": [
        "React",
        "Redux Toolkit",
        "Sass",
        "TypeScript",
        "React Router",
        "i18next",
        "Classnames",
        "Lodash"
      ],
      "imagesSubcategorySrc": "flight-tickets-filter/main/screenshots/",
      "imagesSrc": ["screenshot_1.png", "screenshot_2.png"],
      "url": "https://github.com/moroz-art-dev/flight-tickets-filter",
      "demo": "https://moroz-art-dev.github.io/flight-tickets-filter/"
    },
    {
      "id": "news-app",
      "title": {
        "en": "News",
        "ua": "Новини",
        "ru": "Новости"
      },
      "description": {
        "en": "News App is a news retrieval application powered by an API. It allows users to customize their news query using a user-friendly form and displays two blocks of news content. Users have the flexibility to define their news preferences and the application fetches relevant news articles based on their inputs. The app provides an intuitive way to access and consume news information while offering customization options to tailor the news experience to individual preferences.",
        "ua": "Новинний додаток – це додаток для отримання новин через API. Він дозволяє користувачам налаштовувати запит новин за допомогою зручної форми і відображає два блоки новин. Користувачі мають можливість визначати свої новинні переваги, і додаток отримує відповідні новинні статті на основі їх запитів. Додаток надає інтуїтивний спосіб доступу до новинної інформації з можливістю налаштування досвіду перегляду новин відповідно до індивідуальних уподобань.",
        "ru": "Новостное приложение — это приложение для получения новостей через API. Оно позволяет пользователям настраивать запрос новостей с помощью удобной формы и отображает два блока новостного контента. Пользователи могут настроить свои новостные предпочтения, и приложение получает соответствующие новостные статьи на основе их запросов. Приложение предоставляет интуитивно понятный способ доступа к новостной информации с возможностью настройки новостного опыта в соответствии с индивидуальными предпочтениями."
      },
      "technologies": [
        "React",
        "React Hook Form",
        "Axios",
        "MobX",
        "MobX React Lite",
        "FontAwesome",
        "Tailwind CSS",
        "React HTML Parser",
        "Vite"
      ],
      "imagesSubcategorySrc": "news-app/main/screenshots/",
      "imagesSrc": ["screenshot_1.png", "screenshot_2.png", "screenshot_3.png"],
      "url": "https://github.com/moroz-art-dev/news-app",
      "demo": "https://news-app-eight-amber.vercel.app"
    },
    {
      "id": "little-lemon",
      "title": {
        "en": "Little Lemon",
        "ua": "Little Lemon",
        "ru": "Little Lemon"
      },
      "description": {
        "en": "The project includes a landing page and reservation form for a restaurant, providing essential information and enabling easy table bookings.",
        "ua": "Проект включає посадкову сторінку та форму бронювання столика для ресторану, надаючи необхідну інформацію та забезпечуючи легке бронювання столів.",
        "ru": "Проект включает в себя посадочную страницу и форму бронирования столика для ресторана, предоставляя необходимую информацию и обеспечивая легкое бронирование столов."
      },
      "technologies": [
        "React",
        "React Router",
        "Formik",
        "Prop Types",
        "React Modal",
        "React Scroll",
        "React Select",
        "React Transition Group",
        "Yup"
      ],
      "imagesSubcategorySrc": "little-lemon/main/screenshots/",
      "imagesSrc": [
        "screenshot_1.png",
        "screenshot_2.png",
        "screenshot_3.png",
        "screenshot_4.png",
        "screenshot_5.png",
        "screenshot_6.png"
      ],
      "url": "https://github.com/moroz-art-dev/little-lemon",
      "demo": "https://moroz-art-dev.github.io/little-lemon/"
    },
    {
      "id": "live-search",
      "title": {
        "en": "Live Search",
        "ua": "Живий пошук",
        "ru": "Живой поиск"
      },
      "description": {
        "en": "Live search is a small project that consists of a search input field and a dynamic list of results fetched from an API. It allows users to quickly search for content by typing in their query and instantly see the corresponding results.",
        "ua": "Живий пошук – це невеликий проєкт, що складається з поля пошуку та динамічного списку результатів, отриманих із API. Він дозволяє користувачам швидко шукати контент, вводячи запит, і миттєво бачити відповідні результати.",
        "ru": "Живой поиск — это небольшой проект, состоящий из поля ввода поиска и динамического списка результатов, полученных из API. Он позволяет пользователям быстро искать контент, вводя запрос, и мгновенно видеть соответствующие результаты."
      },
      "technologies": ["Next.js 13", "TypeScript", "MUI", "Redux Toolkit"],
      "imagesSubcategorySrc": "live-search/main/screenshots/",
      "imagesSrc": ["screenshot_1.png"],
      "url": "https://github.com/moroz-art-dev/live-search",
      "demo": "https://live-search-kappa.vercel.app"
    },
    {
      "id": "portfolio",
      "title": {
        "en": "Portfolio",
        "ua": "Портфоліо",
        "ru": "Портфолио"
      },
      "description": {
        "en": "Welcome to my portfolio! Here, I showcase my projects and achievements in software development.",
        "ua": "Ласкаво просимо до мого портфоліо! Тут я демонструю свої проєкти та досягнення в галузі розробки програмного забезпечення.",
        "ru": "Добро пожаловать в мое портфолио! Здесь я демонстрирую свои проекты и достижения в разработке программного обеспечения."
      },
      "technologies": [
        "React",
        "React Slick",
        "Chakra UI",
        "Formik",
        "Yup",
        "Redux Toolkit",
        "RTK Query"
      ],
      "imagesSubcategorySrc": "portfolio/main/screenshots/",
      "imagesSrc": ["screenshot_1.png", "screenshot_2.png"],
      "url": "https://github.com/moroz-art-dev/portfolio",
      "demo": "https://moroz-art-dev.github.io/portfolio/"
    }
  ]
}
